app/controllers/carts_controller.rb

  def index
    carts = Cart.all
---
SELECT "carts".* FROM "carts"