app/controllers/sneakers_controller.rb

  def index
    render json: Sneaker.all
---
SELECT "sneakers".* FROM "sneakers"